Revit 2024 API
MEPAnalyticalSegment.DemandFlow Property
 The designed flow value, in ft^3/s.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double DemandFlow { get; }
Visual Basic
Public ReadOnly Property DemandFlow As Double
	Get
Visual C++
public:
property double DemandFlow {
	double get ();
}
See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace